; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 119265 2 3 4 6 3
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	thermograph2 - mode
	image1 - mode
	spectrograph3 - mode
	spectrograph0 - mode
	GroundStation0 - direction
	Star5 - direction
	Star2 - direction
	GroundStation1 - direction
	Star3 - direction
	Star4 - direction
	Phenomenon6 - direction
	Star7 - direction
	Star8 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star2)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 image1)
	(supports instrument2 spectrograph0)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(supports instrument3 thermograph2)
	(supports instrument3 spectrograph3)
	(supports instrument3 image1)
	(calibration_target instrument3 Star3)
	(supports instrument4 spectrograph3)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star4)
	(calibration_target instrument4 Star3)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
)
(:goal (and
	(have_image Phenomenon6 spectrograph3)
	(have_image Star7 spectrograph3)
	(have_image Star8 spectrograph3)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 3
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 3
3. (turn_to satellite0 star2 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star2)
   goals met: 0 of 3
4. (turn_to satellite1 star8 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star8)
   goals met: 0 of 3
5. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 0 of 3
6. (turn_to satellite1 phenomenon6 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 phenomenon6)
   goals met: 0 of 3
7. (turn_to satellite0 star7 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star7)
   goals met: 0 of 3
8. (turn_to satellite1 star8 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 star8)
   goals met: 0 of 3
9. (take_image satellite0 star7 instrument0 spectrograph3)
   added: (have_image star7 spectrograph3)
   goals met: 1 of 3
10. (turn_to satellite1 star3 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star3)
   goals met: 1 of 3
11. (turn_to satellite0 phenomenon6 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 phenomenon6)
   goals met: 1 of 3
12. (calibrate satellite1 instrument3 star3)
   added: (calibrated instrument3)
   goals met: 1 of 3
13. (take_image satellite0 phenomenon6 instrument0 spectrograph3)
   added: (have_image phenomenon6 spectrograph3)
   goals met: 2 of 3
14. (turn_to satellite1 star8 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 star8)
   goals met: 2 of 3
15. (take_image satellite1 star8 instrument3 spectrograph3)
   added: (have_image star8 spectrograph3)
   goals met: 3 of 3
